# ==========================================
# ENTERPRISE CHATBOT LOGIC (57 QUESTIONS)
# ==========================================

questions_list = [
    {
        "id": "Q1",
        "text": "A. कृपया अपना नाम चुने",
        "type": "dropdown",
        "options": [
            "Ajay", "Alok", "Aryendra", "Deshraj", "Haribhan", "Kripa Shankar", "Neeraj", "Pooja", 
            "Sarfaraj", "Satyendra", "Shivchand", "Sudhir Kumar", "Sudhir Singh", "Vinay", "Viswanath", 
            "Abhinav", "Ashok", "Ateeq", "Hiteshwari", "Rajkumar", "Ramdhan", "Dilip", "Anish Kumar", 
            "Haider", "Rajeev", "Ravindra", "Anurag", "Bhaskar", "Bhawana", "Naveen Chandra", "Ishtiyak", 
            "Mustafa", "Dharmendra", "Gokul", "Naveen", "Ashish", "Other"
        ]
    },
    {
        "id": "Q2",
        "text": "B. अपना नाम लिखें",
        "type": "text"
    },
    {
        "id": "Q3",
        "text": "1. शिक्षक संकुल बैठक की तारीख चुनें",
        "type": "date"
    },
    {
        "id": "Q4",
        "text": "2. शिक्षक संकुल बैठक का माह चुनें",
        "type": "dropdown",
        "options": ["जनवरी", "फ़रवरी", "मार्च", "अप्रैल", "मई", "जून", "जुलाई", "अगस्त", "सितंबर", "अक्टूबर", "नवंबर", "दिसंबर"]
    },
    {
        "id": "Q5",
        "text": "3. केंद्र में कुल शिक्षकों की संख्या कितनी है?",
        "type": "numeric"
    },
    {
        "id": "Q6",
        "text": "4. इस शिक्षक संकुल बैठक में कितने शिक्षक उपस्थित थे?",
        "type": "numeric"
    },
    {
        "id": "Q7",
        "text": "5. इस शिक्षक संकुल बैठक में कितने ब्लॉक अधिकारी उपस्थित रहे ?",
        "type": "numeric"
    },
    {
        "id": "Q8",
        "text": "6. इस शिक्षक संकुल बैठक में कितने ब्लॉक अधिकारी उपस्थित रहे ?",
        "type": "numeric"
    },
    {
        "id": "Q9",
        "text": "7. इस शिक्षक संकुल बैठक में कितने Sikshak Sankul/CAC/CRC उपस्थित रहे ?",
        "type": "numeric"
    },
    {
        "id": "Q10",
        "text": "8. शिक्षक हितधारकों की अपेक्षाओं को कैसे समझतें हैं?",
        "type": "dropdown",
        "options": [
            "माता-पिता की मुख्य अपेक्षा- परीक्षाओं में अच्छा प्रदर्शन",
            "कुछ माता-पिता से अपेक्षा पर चर्चा- बच्चों को कुशल और रोजगार उन्मुख बनाना",
            "अभिभावक/समुदाय की अपेक्षाएँ समझकर अपने तरीकों में शामिल करना",
            "उद्योग जगत, समुदाय, अभिभावक & सरकार की अपेक्षाएँ समझकर अपने तरीकों में शामिल"
        ]
    },
    {
        "id": "Q11",
        "text": "शिक्षक पाठ्यचर्या के लक्ष्यों को कैसे समझतें हैं?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक की सामग्री को पूरा करना",
            "एनसीएफ 2005 & एनईपी 2020 का उल्लेख",
            "संकुल की शैक्षिक आवश्यकताओं के अनुसार लक्ष्यों को हासिल करना",
            "शैक्षिक नीतियों की प्रासंगिकता पर मंथन",
            "योजनाओं का छात्रों के लिए अनुकूलन"
        ]
    },
    {
        "id": "Q12",
        "text": "क्या शिक्षक बच्चों के व्यवहार को निष्पक्षता के साथ देखते हैं?",
        "type": "dropdown",
        "options": [
            "धीमे सीखने वाले, कमजोर छात्रों जैसे शब्दों का इस्तेमाल",
            "बच्चों के व्यवहार के पीछे के कारणों को जानने का प्रयास",
            "व्यवहार को समझते हैं",
            "चर्चा में इसका उल्लेख भी करते",
            "विभिन्न पहलुओं के आधार पर आंकलन",
            "इसके अनुसार आवश्यकताओं को संबोधित करना"
        ]
    },
    {
        "id": "Q13",
        "text": "नए विचारों को अपनाने के प्रति खुलापन और मंथन कैसे होता है ?",
        "type": "dropdown",
        "options": [
            "पारंपरिक कौशलों का उपयोग",
            "फीडबैक प्राप्त करने में सहज नहीं",
            "नए विचारों की खोज का प्रयास",
            "फीडबैक देने के लिए प्रोत्साहित करना",
            "स्वयं सीखने की पहल करते हैं",
            "फीडबैक आदान-प्रदान करते हैं",
            "स्वयं सीखने और आत्ममंथन करने पर कार्य",
            "स्वयं का मूल्यांकन"
        ]
    },
    {
        "id": "Q14",
        "text": "मासिक योजना में क्या क्या शामिल हैं?",
        "type": "dropdown",
        "options": [
            "केवल बैठक के कार्यवृत्ति का हिस्सा",
            "हर कक्षा के महीने के हर पाठ और हर पाठ के LO की पहचान",
            "हर LO के लिए गतिविधियो की पहचान",
            "10 व्यक्तिगत सैंपल योजनाएं तैयार"
        ]
    },
    {
        "id": "Q15",
        "text": "मासिक योजना में LO और गतिविधियों निर्किधारण कैसे किया गया हैं?",
        "type": "dropdown",
        "options": [
            "राज्य द्वारा प्रदान की गई सूची के LOs पर चर्चा",
            "महीने के हर कक्षा के पाठ और हर पाठ के LO को राज्य की सूची से कॉपी किया गया",
            "प्रत्येक विषय +कक्षा के LOs, LOs संबंधित गतिविधियां, थीम की पहचान, कॉन्सेप्ट मैप",
            "नए LOs की पहचान, उनके लिए गतविधिया, माइक्रो LOs बनाना"
        ]
    },
    {
        "id": "Q16",
        "text": "योजना में गतिविधियाँ कहाँ से ली गई हैं?वे किस प्रकार की हैं?",
        "type": "dropdown",
        "options": [
            "गतिविधियों पर मौखिक चर्चा हुई",
            "कुछ LOs के लिए गतिविधियाँ",
            "पाठ्यपुस्तक /शिक्षक संदर्शिका से , नई गतिविधि सृजित नहीं हुई",
            "सभी LOs के गतिविधियाँ",
            "पाठ्यपुस्तक /शिक्षक संदर्शिका + ख़ुद से बनाना",
            "सभी LOs + सीखने के चरण (एक्सपोज़र-अनुभव-प्रैक्टिस) + आंकलन के लिए गतिविधियाँ बनी"
        ]
    },
    {
        "id": "Q17",
        "text": "योजना में किन सीखने के संसाधनों को चिह्नित किया गया हैं?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक + विभाग के टी.एल.एम. के प्रयोग की चर्चा",
            "हर गतिविधि के अनुसार पाठ्यपुस्तक, कार्यपुस्तिका, टी.एल.एम योजना में शामिल",
            "LOs की प्राप्ति के लिए विद्यालय भवन , सभी सामग्री, बाहरी संसाधन योजना में शामिल",
            "LOs से जोड़ते हुए सम्पूर्ण समुदाय, सार्वजनिक संस्थान और उद्योग योजना में शामिल"
        ]
    },
    {
        "id": "Q18",
        "text": "बैठक में कितने विद्यालय और शिक्षक उपस्थित थे?",
        "type": "dropdown",
        "options": [
            "50% से 75% विद्यालय प्रतिनिधि",
            "76% से 90% विद्यालय प्रतिनिधि",
            "91% + विद्यालय प्रतिनिधि",
            "60%-75% शिक्षक",
            "100% विद्यालय प्रतिनिधि",
            "75% + शिक्षक"
        ]
    },
    {
        "id": "Q19",
        "text": "बैठक में कितने प्रतिशत शिक्षक पिछली बैठक में भी उपस्थित थे?",
        "type": "dropdown",
        "options": ["50% से कम शिक्षक", "50%-74% शिक्षक", "75%-89% शिक्षक", "91% + शिक्षक"]
    },
    {
        "id": "Q20",
        "text": "कितने शिक्षकों ने कितने सत्रों की चर्चा में भाग लिया?",
        "type": "dropdown",
        "options": ["1-2 शिक्षक", "हर सत्र में 6-10 शिक्षक", "हर सत्र में 70%-80% शिक्षक", "हर सत्र में 80%+ शिक्षक"]
    },
    {
        "id": "Q21",
        "text": "सत्रों का संचालन किसने किया?",
        "type": "dropdown",
        "options": [
            "केवल CRC",
            "CRC",
            "2-3 शिक्षक",
            "CRC",
            "50%+ शिक्षक बिना किसी सहयोग के कर रहे हैं",
            "CRC",
            "100% सत्र का नेतृत्व शिक्षक बिना किसी सहयोग के कर रहे हैं"
        ]
    },
    {
        "id": "Q22",
        "text": "बैठक में ब्लॉक/ज़िला के उपस्थिति और भागीदारी कैसी रही ?",
        "type": "dropdown",
        "options": [
            "केवल इस संकुल के शिक्षक और CRC",
            "ब्लॉक/ज़िला अधिकारी वर्चुअल या कुछ समय के लिए उपस्थित",
            "ब्लॉक/ज़िला अधिकारी पूरी बैठक में उपस्थित",
            "कुछ चर्चाओं में नेतृत्व",
            "ब्लॉक/ज़िला अधिकारी पूरी बैठक में उपस्थित",
            "सुझाव दिए",
            "शिक्षकों /CRC को नेतृत्व में प्रोत्साहन"
        ]
    },
    {
        "id": "Q23",
        "text": "कितने शिक्षकों ने शेयरिंग में साक्ष्य तथा डेटा का उपयोग किया?",
        "type": "dropdown",
        "options": ["50% से कम", "लगभग 50%", "50%-80%", "80%-100%"]
    },
    {
        "id": "Q24",
        "text": "शिक्षकों की शेयरिंग पर उपस्थित लोगो में से कितने लोगो ने फीडबैक दिया?",
        "type": "dropdown",
        "options": [
            "सिर्फ़ CRC",
            "CRC",
            "1-2 शिक्षक",
            "CRC",
            "50% शिक्षक",
            "CRC",
            "60%-100% शिक्षक"
        ]
    },
    {
        "id": "Q25",
        "text": "फीडबैक की गुणवत्ता कैसी थी?",
        "type": "dropdown",
        "options": [
            "सामान्य फीडबैक",
            "स्पष्ट फीडबैक",
            "रचनात्मक और अगले कदमों पर ध्यान की आवश्यकता",
            "स्पष्ट फीडबैक",
            "अनुभव-आधारित",
            "स्पष्ट फीडबैक",
            "अनुभव-आधारित",
            "अगले कदमों का उल्लेख"
        ]
    },
    {
        "id": "Q26",
        "text": "क्या बैठक की चर्चा समाधान केंद्रित थी?",
        "type": "dropdown",
        "options": [
            "विभाग को भेजने के लिए समस्याओं की सूची बनाई गई",
            "समस्याओं पर समाधान खोजने के लिए चर्चा हुई",
            "CRC + 1-2 शिक्षक ही शामिल",
            "सभी समस्याओं पर समाधान खोजने के लिए चर्चा",
            "50%+ से अधिक शिक्षक शामिल",
            "स्वाभाविक रूप से समस्याओं और चुनौतियों की पहचान",
            "50%+ से अधिक शिक्षक शामिल"
        ]
    },
    {
        "id": "Q27",
        "text": "CRC द्वारा बैठक आयोजन हेतु एजेंडा और अन्य तैयारियों का स्तर कैसा रहा ?",
        "type": "dropdown",
        "options": [
            "बैठक से আগে एजेंडा भेजा",
            "5 कार्य दिवस पहले एजेंडा भेजा",
            "शिक्षकों को तैयारी के साथ आने का सुझाव",
            "छात्रों +शिक्षक विकास के पहलुओं की पहचान",
            "एजेंडा में शामिल",
            "शिक्षकों के साथ योजना",
            "पिछले TC की निरंतरता, क्लस्टर की आवशकताएँ, छात्रों की सीखने की क्षमता",
            "शिक्षकों के विकास और हर सत्र पर योजना"
        ]
    },
    {
        "id": "Q28",
        "text": "CRC की सारे सत्रों में उपस्थिति और नेतृत्व लेने का स्तर कैसा रहा ?",
        "type": "dropdown",
        "options": [
            "सारे सत्रो में उपस्थित",
            "सारे सत्रो में उपस्थित",
            "1-2 सत्र का नेतृत्व",
            "सारे सत्रो का नेतृत्व",
            "सारे सत्रो का नेतृत्व",
            "शिक्षकों को नेतृत्व लेने के लिए सहयोग और प्रोत्साहन"
        ]
    },
    {
        "id": "Q29",
        "text": "CRC ने अकादमिक योजना बनाने में कैसा नेतृत्व लिया?",
        "type": "dropdown",
        "options": [
            "मौखिक योजना",
            "लिखित योजना",
            "छात्रा/संकुल की आवश्यकताओं से जोड़ने की जरुरत",
            "विभाग के प्राथमिकता",
            "ब्लॉक स्तर की योजना",
            "प्रत्येक LO के लिए गतिविधियाँ",
            "छात्रा/संकुल की आवश्यकता",
            "एक्सपोज़र विज़िट",
            "व्यक्ति +संसाधनों की पहचान"
        ]
    },
    {
        "id": "Q30",
        "text": "बैठक आयोजन का पत्र किसके द्वारा और कब जारी किया गया?",
        "type": "dropdown",
        "options": [
            "जारी नहीं किया",
            "सहयोग की आवश्यकता",
            "CRC/ब्लॉक अधिकारियों द्वारा जारी",
            "राज्य/जिला स्तर का पत्र 1 सप्ताह पहले जारी",
            "राज्य/जिला हर महीने एजेंडा तैयार करने से पहले सीधे फील्ड से सुझाव लेते हैं"
        ]
    },
    {
        "id": "Q31",
        "text": "बैठक में सारी मूलभूत सुविधाओं की व्यवस्था कैसी रही ?",
        "type": "dropdown",
        "options": [
            "मूलभूत संसाधनों के साथ आयोजित",
            "कक्ष की सफाई",
            "बैठने की व्यवस्था",
            "आवश्यक सुविधाएँ",
            "प्रोजेक्टर/टीवी का समुचित उपयोग",
            "सक्रिय भागीदारी के लिए उपयुक्त",
            "पूरे संकुल से संसाधनों एकत्रित"
        ]
    },
    {
        "id": "Q32",
        "text": "बैठक की कार्यवाही का दस्तावेजीकरण कैसा रहा ?",
        "type": "dropdown",
        "options": [
            "मुख्य बिंदुओं को लिखना और हस्ताक्षर",
            "चर्चा के सारे बिंदु लिखे गए",
            "बैठक रजिस्टर में पूरी चर्चा दर्ज हुई",
            "अकादमिक योजना भी",
            "छोटे से छोटे बिंदु",
            "सभी प्रतिभागियों और ब्लॉक में साझा किया गया"
        ]
    },
    {
        "id": "Q33",
        "text": "बैठक कब-कब आयोजित की जाती है ?",
        "type": "dropdown",
        "options": [
            "आवश्यकता पड़ने पर आयोजित वर्ष में 2 से 4 बार",
            "एक वर्ष में 8 के आसपास बैठकें आयोजित",
            "एक वर्ष में 10 बैठकें और नियमित प्रक्रिया के रूप में",
            "एक वर्ष में 12 बैठकें, अनिवार्य अंग के रूप में"
        ]
    },
    {
        "id": "Q34",
        "text": "शिक्षक अभिवावकों से कब-कब संवाद करते हैं और उनके फीडबैक को कैसे अपनाते हैं?",
        "type": "dropdown",
        "options": [
            "संवाद केवल साल में एक बार रिपोर्ट कार्ड साझा करने के दौरान किया जाता हैं",
            "त्रैमासिक रूप से बैठकें की जाती है पर फीडबैक के अवसर सीमित हैं",
            "अभिभावकों के फीडबैक देने के प्रचुर अवसर सृजित करें जाते हैं",
            "प्रत्येक माह अभिभावकों से मिलते हैं",
            "उनकें सुझाव को योजनाओं और प्रक्रिया में शामिल करतें हैं"
        ]
    },
    {
        "id": "Q35",
        "text": "मासिक स्कूल प्रबंधन समिति की बैठक में शिक्षक की भागीदारी का स्तर कैसा है ?",
        "type": "dropdown",
        "options": [
            "भागीदारी सीमित और अनियमित हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं लेकिन सीख पर सुझाव सीमित रहता हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं और विद्यालय विकास + सीख पर विचार साझा करते हैं",
            "वे विद्यालय विकास योजना बनाने में सहयोग भी करते हैं"
        ]
    },
    {
        "id": "Q36",
        "text": "शिक्षक द्वारा समुदाय की भागीदारी बढ़ाने के लिए प्रयास का स्तर कैसा है ?",
        "type": "dropdown",
        "options": [
            "केवल तब ही संवाद करना जब वे ख़ुद शिक्षक को संपर्क करते",
            "सामाजिक या विभागीय कार्यक्रमों के दौरान ही संवाद करना",
            "स्थानीय संसाधनों की निर्देशिका तैयार",
            "आवश्यकता अनुसार सामुदाय से सहयोग माँगना",
            "महीने में एक बार बच्चों को स्थानीय संसाधनों के साथ संवाद का अवसर",
            "सामुदाय सहभागिता की योजना"
        ]
    },
    {
        "id": "Q37",
        "text": "कक्षा योजना बनाने के लिए किन प्रारूपों और सूत्रो का उपयोग किया जा रहा हैं?",
        "type": "dropdown",
        "options": [
            "विभाग द्वारा प्रदान योजना",
            "व्यक्तिगत रूप से बनाई गई योजना",
            "संकुल बैठक में बनाई योजना",
            "बच्चों और समुदाय के सुझाव योजना में शामिल"
        ]
    },
    {
        "id": "Q38",
        "text": "बनायी गई योजना में LO को शामिल किया जाना और उनका स्रोत कैसा है ?",
        "type": "dropdown",
        "options": [
            "विभाग की सूची से लिए गए है",
            "इस माह के पाठ्यक्रम से लिए गए है",
            "चिन्हित अवधारणों को ध्यान में रख कर लिए गए है",
            "बच्चों की जरूरतों को समझते हुए",
            "विभिन्न विषयों के बीच परस्पर जोड़ कर चिह्नित किए गए हैं"
        ]
    },
    {
        "id": "Q39",
        "text": "योजना में शामिल गतिविधियों की स्थिति कैसी है ?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक को और रोचक बनाने के लिए गतिविधियाँ शामिल की गई हैं",
            "पाठ्यपुस्तक की गतिविधियाँ योजना में नियमित रूप से व्यवस्थित की गई हैं",
            "प्रत्येक LO के लिए, अवधारणात्मक + दक्षता पर केंद्रित गतिविधियाँ चिह्नित की गई हैं",
            "वास्तविक जीवन के संदर्भ में कौशलों के उपयोग और समुदाय की आवश्यकताओं को पूरा करने के लिए गतिविधियाँ शामिल की गई हैं"
        ]
    },
    {
        "id": "Q40",
        "text": "शिक्षक, किस प्रकार की बैठने की व्यवस्था का उपयोग कर रही/रहे हैं?",
        "type": "dropdown",
        "options": [
            "पंक्तियो में बैठना",
            "बालक और बालिका अलग-अलग बैठनाना",
            "बिना उद्देश्य समझे व्यवस्था बदलना",
            "बड़ा समूह, छोटा समूह, व्यक्तिगत अभ्यास कार्य के अनुसार बैठने की व्यवस्था बदलना",
            "बड़ा -छोटा समूह और व्यक्तिगत अभ्यास के अलावा अन्य संरचनाएं बनाना",
            "बच्चे स्वयं भी बैठक व्यवस्था तय करते हैं"
        ]
    },
    {
        "id": "Q41",
        "text": "शिक्षक द्वारा संसाधनों के उपयोग और LO से उनके जुड़ाव का स्तर कैसा है ?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक और ब्लैकबोर्ड",
            "विभिन्न संसाधनों का उपयोग पर LO से सुमेलित नहीं",
            "LO से सुमेलित उपलब्ध संसाधनों का उपयोग",
            "LO से सुमेलित स्थानीय संसाधनों का उपयोग"
        ]
    },
    {
        "id": "Q42",
        "text": "शिक्षक बच्चों को चर्चा, संवाद और गतिविधियों में भागीदारी तथा नेतृत्व करने के अवसर कैसे प्रदान कर रही/रहे है?",
        "type": "dropdown",
        "options": [
            "चर्चा के अवसर नहीं है",
            "बच्चें चुपचाप बैठे हैं",
            "चुनिंदा बच्चों को सहभागिता का अवसर दिया है",
            "“सही” या पूर्वनिर्धारित उत्तरों की ही अपेक्षा हैं",
            "हर बच्चे को भाग लेने का अवसर है",
            "खुले प्रश्न सोचने के पर्याप्त समय के साथ पूछे जा रहे हैं",
            "भागीदारी पर मंथन किया है",
            "बच्चों को गतिविधियों और चर्चाओं में नेतृत्व के लिए प्रोत्साहन दिया गया है"
        ]
    },
    {
        "id": "Q43",
        "text": "शिक्षक को पाठ्यपुस्तक के विषयवस्तु में अवधारणाओं और आवश्यक जानकारी की कितनी गहरी समझ हैं?",
        "type": "dropdown",
        "options": [
            "सिर्फ़ पाठ्यपुस्तक के विषयवस्तु से परिचित हैं",
            "सीखने वाली अवधारणाओं और आवश्यक जानकारी की समझ हैं",
            "कौशलों को सिखाने की दक्षता हैं",
            "मुख्य जानकारी के महत्व की समझ हैं",
            "दोनों की गहरी समझ है और वे उसका शिक्षण विधियों, पाठ्यक्रम के लक्ष्यों और बच्चों की जरूरतों के अनुसार उपयोग करते हैं"
        ]
    },
    {
        "id": "Q44",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किन विधियों का प्रयोग करते हैं ?",
        "type": "dropdown",
        "options": [
            "व्याख्यान विधि का उपयोग",
            "बच्चों के जीवन के उदाहरणों से जोड़ते हुए रोचक बनाकर",
            "पाठ्यचर्या के लक्ष्यों और विषय के प्रमुख विचार से जोड़ते हुए",
            "अवधारणाओं की समझ और कौशलों का विकास गतिविधियों (इनडोर और आउटडोर) में सम्मिलित",
            "विद्यार्थियों को समझकर और उनसे संबंध स्थापित करना",
            "विषयवस्तु और लर्निंग आउटकम्स (LOs) को जीवन के लक्ष्यों से जोड़ना"
        ]
    },
    {
        "id": "Q45",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किस प्रकार से बच्चों का रचनात्मत आंकलन करते हैं?",
        "type": "dropdown",
        "options": [
            "मौखिक रूप से समझ जानने की कोशिश",
            "बच्चों को अपनी समझ को प्रकट करने का अवसर",
            "सीखने की विविध गतिविधियों के दौरान",
            "अवलोकन और पूछे गए प्रश्न",
            "बच्चों को लिखित फीडबैक और आगे के लिए सुझाव"
        ]
    },
    {
        "id": "Q46",
        "text": "शिक्षक बच्चों की आवधारात्मक समझ का आंकलन कैसे करते हैं?",
        "type": "dropdown",
        "options": [
            "याददास्त वाले प्रश्न जैसे - नाम बताना और विशेषताओं की सूची बनाना",
            "सही समझ, पूर्ण समझ, अवधारणाओं के बारे में दुविधाओं को जान पाने वाले प्रश्नों के द्वारा",
            "परिभाषित करना, तुलना करना और जानकारी का उपयोग करने वाले प्रश्न के द्वारा",
            "उदाहरण देना, अवधारणाओं से संबंध स्थापित करना",
            "अवधारणा मानचित्र के द्वारा"
        ]
    },
    {
        "id": "Q47",
        "text": "शिक्षक बच्चों के कौशल विकास का आंकलन कैसे करते हैं?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक-आधारित प्रश्न- मौखिक और लिखित",
            "लिखित परीक्षा और दिए गए टास्क पर प्रदर्शन",
            "सीख टास्क पर काम करने के दौरान अवलोकन और आंकलन प्रपत्र के द्वारा",
            "व्यक्तिगत फीडबैक प्रदान करना",
            "प्रत्येक कौशल में प्रगति का विभिन्न परिस्थितियों द्वारा आंकलन"
        ]
    },
    {
        "id": "Q48",
        "text": "शिक्षक फीडबैक के लिए किन प्रणालियों का उपयोग करते हैं? उनका फीडबैक किस प्रकार का होता हैं?",
        "type": "dropdown",
        "options": [
            "परीक्षा पत्रों/कॉपी पर सामान्य फ़ीडबैक (जैसे: बहुत अच्छा/अत्यंत कमजोर)",
            "परीक्षा पत्रों/कॉपी के आधार पर रचनात्मक फ़ीडबैक (सकारात्मक)",
            "कक्षा प्रक्रिया के दौरान अवलोकन दर्ज करना",
            "सहपाठियों के द्वारा आंकलन",
            "स्व-आंकलन का अवसर",
            "सहपाठि, स्व और अभिभावक फीडबैक को उद्देश्य-परक बनाना",
            "उसका नियमित दस्तावेज़ीकर्ण करना"
        ]
    },
    {
        "id": "Q49",
        "text": "शिक्षक अपनी फाइल में किस प्रारूप में कक्षा योजना और बच्चों का अवलोकन दर्ज करते हैं?",
        "type": "dropdown",
        "options": [
            "अनौपचारिक रूप से/ कभी-कभी किए जाते हैं",
            "विभाग द्वारा प्रदान किए गए प्रारूप पर",
            "सहयोग के साथ- संकुल बैठक में तय प्रारूप पर",
            "अवलोकन कर उसे दर्ज किया जाता",
            "शिक्षक फ़ाइल में व्यवस्थित रूप में योजनाएँ रहती हैं",
            "प्रारूपों पर विभिन्न क्षमताओं का अवलोकन दर्ज किया जाता है"
        ]
    },
    {
        "id": "Q50",
        "text": "समूह कार्य का दस्तावेज़ कहाँ और कैसे उपलब्ध हैं ?",
        "type": "dropdown",
        "options": [
            "बच्चों की व्यक्तिगत कॉपी में उपलब्ध",
            "समूह कार्य फ़ाइल में उपलब्ध पर अव्यवस्थित",
            "नियमित (सप्ताह में दो बार) और वयस्थित रूप में फ़ाइल में उपलब्ध",
            "सहपाठी फीडबैक तथा शिक्षक फीडबैक भी फाइल में उपलब्ध"
        ]
    },
    {
        "id": "Q51",
        "text": "बच्चों के कार्य और प्रगति कहाँ और किस तरह से उपलब्ध है?",
        "type": "dropdown",
        "options": [
            "आंकलन सिर्फ़ परीक्षा पत्रों और रिपोर्ट कार्ड में उपलब्ध",
            "होलिस्टिक रिपोर्ट कार्ड में मासिक/त्रैमासिक रूप में उपलब्ध",
            "व्यक्दिगत कार्य पोर्टफोलियो में उपलब्ध",
            "सप्ताह में कम से कम दो बार लिखित फीडबैक दर्ज",
            "पोर्टफोलियो ऐसे व्यवस्थित कि उनसे बच्चों की प्रगति स्पष्ट हो पाये",
            "सीख प्रोफाइल में पोर्टफोलियो का उपयोग"
        ]
    },
    {
        "id": "Q52",
        "text": "क्या शिक्षक विषय से संबंधित महत्वपूर्ण विचारों को समझतें हैं? वह विषय को पढ़ने के लिए किस प्रकार की गतिविधियों का उपयोग करतें हैं?",
        "type": "dropdown",
        "options": [
            "पारंपरिक पद्धति- पाठ सामग्री समझाना और अभ्यास प्रश्न का उल्लेख करना",
            "विभिन्न गतिविधियाँ खोजना",
            "विभाग द्वारा सूचीबद्ध अनुसार गतिविधियाँ",
            "दक्षताएं विकसित करने पर केंद्रित गतिविधियाँ"
        ]
    },
    {
        "id": "Q53",
        "text": "क्या शिक्षक को सीखने की विभिन्न शैलियाँ के बारें में जानकारी हैं? वे उससे सीख सामग्री का प्रस्तुतीकरण में कैसे शामिल करतें हैं?",
        "type": "dropdown",
        "options": [
            "कक्षा और उम्र के अनुसार गतिविधि",
            "विविध शैलियों के लिए अलग गतिविधि पर चर्चा",
            "सहयोग की आवशयकता",
            "विविध शैलियों के लिए अलग गतिविधि योजना में शामिल",
            "शैलियों की समझ उपयुक्त गतिविधियाँ",
            "समीक्षा करते है"
        ]
    },
    {
        "id": "Q54",
        "text": "शिक्षक हितधारकों की अपेक्षाओं को कैसे समझतें हैं?",
        "type": "dropdown",
        "options": [
            "माता-पिता की मुख्य अपेक्षा- परीक्षाओं में अच्छा प्रदर्शन",
            "कुछ माता-पिता से अपेक्षा पर चर्चा- बच्चों को कुशल और रोजगार उन्मुख बनाना",
            "अभिभावक/समुदाय की अपेक्षाएँ समझकर अपने तरीकों में शामिल करना",
            "उद्योग जगत, समुदाय, अभिभावक & सरकार की अपेक्षाएँ समझकर अपने तरीकों में शामिल"
        ]
    },
    {
        "id": "Q55",
        "text": "शिक्षक पाठ्यचर्या के लक्ष्यों को कैसे समझतें हैं?",
        "type": "dropdown",
        "options": [
            "पाठ्यपुस्तक की सामग्री को पूरा करना",
            "एनसीएफ 2005 & एनईपी 2020 का उल्लेख",
            "संकुल की शैक्षिक आवश्यकताओं के अनुसार लक्ष्यों को हासिल करना",
            "शैक्षिक नीतियों की प्रासंगिकता पर मंथन",
            "योजनाओं का छात्रों के लिए अनुकूलन"
        ]
    },
    {
        "id": "Q56",
        "text": "क्या शिक्षक बच्चों के व्यवहार को निष्पक्षता के साथ देखते हैं?",
        "type": "dropdown",
        "options": [
            "धीमे सीखने वाले, कमजोर छात्रों जैसे शब्दों का इस्तेमाल",
            "बच्चों के व्यवहार के पीछे के कारणों को जानने का प्रयास",
            "व्यवहार को समझते हैं",
            "चर्चा में इसका उल्लेख भी करते",
            "विभिन्न पहलुओं के आधार पर आंकलन",
            "इसके अनुसार आवश्यकताओं को संबोधित करना"
        ]
    },
    {
        "id": "Q57",
        "text": "क्या शिक्षक में सीखने की ओर खुलापन हैं? वे किस तरह की विधियों का उपयोग करना सही समझतें हैं?",
        "type": "dropdown",
        "options": [
            "पारंपरिक कौशलों का उपयोग",
            "फीडबैक प्राप्त करने में सहज नहीं",
            "नए विचारों की खोज का प्रयास",
            "फीडबैक देने के लिए प्रोत्साहित करना",
            "स्वयं सीखने की पहल करते हैं",
            "फीडबैक आदान-प्रदान करते हैं",
            "स्वयं सीखने और आत्ममंथन करने पर कार्य",
            "स्वयं का मूल्यांकन"
        ]
    }
]