"""
AUTO-GENERATED FILE
Contains standard questions and checkbox indicators.
"""

# --- PART 1: FORM FIELD QUESTIONS (Q1-Q56) ---
questions_list = [
    {
        "id": "Q1",
        "text": "शिक्षक संकुल बैठक की तारीख चुनें",
        "type": "Date",
        "category": "Teacher's Collective",
        "options": [
            "Hierarchy"
        ]
    },
    {
        "id": "Q2",
        "text": "शिक्षक संकुल बैठक का माह चुनें",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "जनवरी",
            "फ़रवरी",
            "मार्च",
            "अप्रैल",
            "मई",
            "जून",
            "जुलाई",
            "अगस्त",
            "सितंबर",
            "अक्टूबर",
            "नवंबर",
            "दिसंबर"
        ]
    },
    {
        "id": "Q3",
        "text": "केंद्र में कुल शिक्षकों की संख्या कितनी है?",
        "type": "Numeric",
        "category": "Teacher's Collective",
        "options": []
    },
    {
        "id": "Q4",
        "text": "इस शिक्षक संकुल बैठक में कितने शिक्षक उपस्थित थे?",
        "type": "Numeric",
        "category": "Teacher's Collective",
        "options": []
    },
    {
        "id": "Q5",
        "text": "इस शिक्षक संकुल बैठक में कितने ब्लॉक अधिकारी उपस्थित रहे ?",
        "type": "Numeric",
        "category": "Teacher's Collective",
        "options": []
    },
    {
        "id": "Q6",
        "text": "इस शिक्षक संकुल बैठक में कितने ब्लॉक अधिकारी उपस्थित रहे ?",
        "type": "Numeric",
        "category": "Teacher's Collective",
        "options": []
    },
    {
        "id": "Q7",
        "text": "इस शिक्षक संकुल बैठक में कितने Sikshak Sankul/CAC/CRC उपस्थित रहे ?",
        "type": "Numeric",
        "category": "Teacher's Collective",
        "options": []
    },
    {
        "id": "Q8",
        "text": "शिक्षक हितधारकों की अपेक्षाओं को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "माता-पिता की मुख्य अपेक्षा- परीक्षाओं में अच्छा प्रदर्शन",
            "कुछ माता-पिता से अपेक्षा पर चर्चा- बच्चों को कुशल और रोजगार उन्मुख बनाना",
            "अभिभावक/समुदाय की अपेक्षाएँ समझकर अपने तरीकों में शामिल करना",
            "उद्योग जगत",
            "समुदाय",
            "अभिभावक & सरकार की अपेक्षाएँ समझकर अपने तरीकों में शामिल"
        ]
    },
    {
        "id": "Q9",
        "text": "शिक्षक पाठ्यचर्या के लक्ष्यों को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "पाठ्यपुस्तक की सामग्री को पूरा करना",
            "एनसीएफ 2005 & एनईपी 2020 का उल्लेख",
            "संकुल की शैक्षिक आवश्यकताओं के अनुसार लक्ष्यों को हासिल करना",
            "शैक्षिक नीतियों की प्रासंगिकता पर मंथन",
            "योजनाओं का छात्रों के लिए अनुकूलन"
        ]
    },
    {
        "id": "Q10",
        "text": "क्या शिक्षक बच्चों के व्यवहार को निष्पक्षता के साथ देखते हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "धीमे सीखने वाले",
            "कमजोर छात्रों जैसे शब्दों का इस्तेमाल",
            "बच्चों के व्यवहार के पीछे के कारणों को जानने का प्रयास",
            "व्यवहार को समझते हैं",
            "चर्चा में इसका उल्लेख भी करते",
            "विभिन्न पहलुओं के आधार पर आंकलन",
            "इसके अनुसार आवश्यकताओं को संबोधित करना"
        ]
    },
    {
        "id": "Q11",
        "text": "नए विचारों को अपनाने के प्रति खुलापन और मंथन कैसे होता है ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "पारंपरिक कौशलों का उपयोग",
            "फीडबैक प्राप्त करने में सहज नहीं",
            "नए विचारों की खोज का प्रयास",
            "फीडबैक देने के लिए प्रोत्साहित करना",
            "स्वयं सीखने की पहल करते हैं",
            "फीडबैक आदान-प्रदान करते हैं",
            "स्वयं सीखने और आत्ममंथन करने पर कार्य",
            "स्वयं का मूल्यांकन"
        ]
    },
    {
        "id": "Q12",
        "text": "मासिक योजना  में क्या क्या शामिल हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "केवल बैठक के कार्यवृत्ति का हिस्सा",
            "हर कक्षा के  महीने के हर पाठ और हर पाठ के LO की पहचान",
            "हर LO के लिए गतिविधियो की पहचान",
            "10 व्यक्तिगत सैंपल योजनाएं तैयार"
        ]
    },
    {
        "id": "Q13",
        "text": "मासिक योजना में LO और गतिविधियों निर्किधारण कैसे किया गया हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "राज्य द्वारा प्रदान की गई सूची के LOs पर चर्चा",
            "महीने के हर कक्षा के पाठ और हर पाठ के LO को राज्य की सूची से कॉपी किया गया",
            "प्रत्येक विषय +कक्षा के LOs",
            "LOs संबंधित गतिविधियां",
            "थीम की पहचान",
            "कॉन्सेप्ट मैप",
            "नए  LOs की  पहचान",
            "उनके लिए गतविधिया",
            "माइक्रो LOs बनाना"
        ]
    },
    {
        "id": "Q14",
        "text": "योजना में गतिविधियाँ कहाँ से ली गई हैं?वे किस प्रकार की हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "गतिविधियों पर मौखिक चर्चा हुई",
            "कुछ  LOs के लिए गतिविधियाँ",
            "पाठ्यपुस्तक /शिक्षक संदर्शिका से",
            "नई गतिविधि सृजित नहीं हुई",
            "सभी  LOs के गतिविधियाँ",
            "पाठ्यपुस्तक /शिक्षक संदर्शिका + ख़ुद से बनाना",
            "सभी  LOs + सीखने के चरण (एक्सपोज़र-अनुभव-प्रैक्टिस) + आंकलन  के लिए गतिविधियाँ  बनी"
        ]
    },
    {
        "id": "Q15",
        "text": "योजना में किन सीखने के संसाधनों को चिह्नित किया गया हैं?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "पाठ्यपुस्तक + विभाग के टी.एल.एम. के प्रयोग की चर्चा",
            "हर गतिविधि के अनुसार पाठ्यपुस्तक",
            "कार्यपुस्तिका",
            "टी.एल.एम योजना में शामिल",
            "LOs की प्राप्ति के लिए विद्यालय भवन",
            "सभी सामग्री",
            "बाहरी संसाधन  योजना में शामिल",
            "LOs से जोड़ते हुए सम्पूर्ण समुदाय",
            "सार्वजनिक संस्थान और उद्योग योजना में शामिल"
        ]
    },
    {
        "id": "Q16",
        "text": "बैठक में कितने विद्यालय और शिक्षक उपस्थित थे?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "50% से 75% विद्यालय प्रतिनिधि",
            "76% से 90% विद्यालय प्रतिनिधि",
            "91% + विद्यालय प्रतिनिधि",
            "60%-75% शिक्षक",
            "100% विद्यालय प्रतिनिधि",
            "75% + शिक्षक"
        ]
    },
    {
        "id": "Q17",
        "text": "बैठक में कितने प्रतिशत शिक्षक पिछली बैठक में भी उपस्थित थे?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "50% से कम शिक्षक",
            "50%-74% शिक्षक",
            "75%-89% शिक्षक",
            "91% + शिक्षक"
        ]
    },
    {
        "id": "Q18",
        "text": "कितने शिक्षकों ने कितने सत्रों की चर्चा में भाग लिया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "1-2 शिक्षक",
            "हर सत्र  में  6-10 शिक्षक",
            "हर सत्र  में  70%-80% शिक्षक",
            "हर सत्र  में  80%+ शिक्षक"
        ]
    },
    {
        "id": "Q19",
        "text": "सत्रों का संचालन किसने किया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "केवल CRC",
            "CRC",
            "2-3 शिक्षक",
            "CRC",
            "50%+ शिक्षक बिना किसी सहयोग के कर रहे हैं",
            "CRC",
            "100% सत्र का नेतृत्व शिक्षक बिना किसी सहयोग के कर रहे हैं"
        ]
    },
    {
        "id": "Q20",
        "text": "बैठक में ब्लॉक/ज़िला  के उपस्थिति और भागीदारी कैसी रही ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "केवल इस संकुल के शिक्षक और CRC",
            "ब्लॉक/ज़िला अधिकारी वर्चुअल या कुछ समय के लिए उपस्थित",
            "ब्लॉक/ज़िला अधिकारी पूरी बैठक में उपस्थित",
            "कुछ चर्चाओं में नेतृत्व",
            "ब्लॉक/ज़िला अधिकारी पूरी बैठक में उपस्थित",
            "सुझाव दिए",
            "शिक्षकों /CRC को नेतृत्व में प्रोत्साहन"
        ]
    },
    {
        "id": "Q21",
        "text": "कितने शिक्षकों ने शेयरिंग में  साक्ष्य तथा डेटा का उपयोग किया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "50% से कम",
            "लगभग 50%",
            "50%-80%",
            "80%-100%"
        ]
    },
    {
        "id": "Q22",
        "text": "शिक्षकों की शेयरिंग पर उपस्थित लोगो में से कितने लोगो ने फीडबैक दिया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "सिर्फ़ CRC",
            "CRC",
            "1-2 शिक्षक",
            "CRC",
            "50% शिक्षक",
            "CRC",
            "60%-100% शिक्षक"
        ]
    },
    {
        "id": "Q23",
        "text": "फीडबैक  की गुणवत्ता कैसी थी?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "सामान्य फीडबैक",
            "स्पष्ट फीडबैक",
            "रचनात्मक और अगले कदमों  पर ध्यान की  आवश्यकता",
            "स्पष्ट फीडबैक",
            "अनुभव-आधारित",
            "स्पष्ट फीडबैक",
            "अनुभव-आधारित",
            "अगले कदमों का उल्लेख"
        ]
    },
    {
        "id": "Q24",
        "text": "क्या बैठक की चर्चा समाधान केंद्रित थी?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "विभाग को भेजने के लिए समस्याओं की सूची बनाई गई",
            "समस्याओं पर समाधान खोजने के लिए चर्चा हुई",
            "CRC + 1-2 शिक्षक ही शामिल",
            "सभी समस्याओं पर समाधान खोजने के लिए चर्चा",
            "50%+ से अधिक शिक्षक शामिल",
            "स्वाभाविक रूप से समस्याओं और चुनौतियों की पहचान",
            "50%+ से अधिक शिक्षक शामिल"
        ]
    },
    {
        "id": "Q25",
        "text": "CRC द्वारा  बैठक आयोजन  हेतु एजेंडा और अन्य तैयारियों का स्तर कैसा रहा ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "बैठक से पहले एजेंडा भेजा",
            "5 कार्य दिवस पहले एजेंडा भेजा",
            "शिक्षकों को तैयारी के साथ आने का सुझाव",
            "छात्रों +शिक्षक विकास के पहलुओं की पहचान",
            "एजेंडा में शामिल",
            "शिक्षकों के साथ योजना",
            "पिछले TC की निरंतरता",
            "क्लस्टर की आवशकताएँ",
            "छात्रों की सीखने की क्षमता",
            "शिक्षकों के विकास और हर सत्र पर योजना"
        ]
    },
    {
        "id": "Q26",
        "text": "CRC की सारे सत्रों में  उपस्थिति  और  नेतृत्व लेने का स्तर कैसा रहा ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "सारे सत्रो में उपस्थित",
            "सारे सत्रो में उपस्थित",
            "1-2 सत्र का नेतृत्व",
            "सारे सत्रो का नेतृत्व",
            "सारे सत्रो का नेतृत्व",
            "शिक्षकों को  नेतृत्व लेने के लिए सहयोग और प्रोत्साहन"
        ]
    },
    {
        "id": "Q27",
        "text": "CRC ने अकादमिक योजना बनाने में  कैसा नेतृत्व लिया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "मौखिक योजना",
            "लिखित योजना",
            "छात्रा/संकुल की आवश्यकताओं से जोड़ने की जरुरत",
            "विभाग के प्राथमिकता",
            "ब्लॉक स्तर की योजना",
            "प्रत्येक LO के लिए गतिविधियाँ",
            "छात्रा/संकुल की आवश्यकता",
            "एक्सपोज़र विज़िट",
            "व्यक्ति +संसाधनों की पहचान"
        ]
    },
    {
        "id": "Q28",
        "text": "बैठक आयोजन का पत्र किसके द्वारा और कब जारी किया गया?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "जारी नहीं किया",
            "सहयोग की आवश्यकता",
            "CRC/ब्लॉक अधिकारियों द्वारा जारी",
            "राज्य/जिला स्तर का पत्र 1 सप्ताह पहले जारी",
            "राज्य/जिला हर महीने एजेंडा तैयार करने से पहले सीधे फील्ड से सुझाव लेते हैं"
        ]
    },
    {
        "id": "Q29",
        "text": "बैठक में सारी मूलभूत सुविधाओं की व्यवस्था कैसी रही ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "मूलभूत संसाधनों के साथ आयोजित",
            "कक्ष की सफाई",
            "बैठने की व्यवस्था",
            "आवश्यक सुविधाएँ",
            "प्रोजेक्टर/टीवी का समुचित उपयोग",
            "सक्रिय भागीदारी के लिए उपयुक्त",
            "पूरे संकुल से संसाधनों एकत्रित"
        ]
    },
    {
        "id": "Q30",
        "text": "बैठक की कार्यवाही का दस्तावेजीकरण कैसा रहा ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "मुख्य बिंदुओं  को लिखना और",
            "हस्ताक्षर",
            "चर्चा के सारे बिंदु लिखे गए",
            "बैठक रजिस्टर में  पूरी  चर्चा दर्ज हुई",
            "अकादमिक योजना भी",
            "छोटे से छोटे बिंदु",
            "सभी प्रतिभागियों और ब्लॉक में साझा किया गया"
        ]
    },
    {
        "id": "Q31",
        "text": "बैठक कब-कब आयोजित की जाती है ?",
        "type": "Dropdown",
        "category": "Teacher's Collective",
        "options": [
            "आवश्यकता पड़ने पर आयोजित  वर्ष में 2 से 4 बार",
            "एक वर्ष में  8 के आसपास  बैठकें  आयोजित",
            "एक वर्ष में 10 बैठकें और नियमित प्रक्रिया के रूप में",
            "एक वर्ष में 12 बैठकें",
            "अनिवार्य अंग  के रूप में"
        ]
    },
    {
        "id": "Q1",
        "text": "शिक्षक अभिवावकों से कब-कब संवाद करते हैं और  उनके फीडबैक को कैसे अपनाते  हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "संवाद केवल साल में एक बार रिपोर्ट कार्ड साझा करने के दौरान किया जाता हैं",
            "त्रैमासिक रूप से बैठकें की जाती है पर फीडबैक के अवसर सीमित हैं",
            "अभिभावकों के फीडबैक देने के प्रचुर अवसर सृजित करें जाते हैं",
            "प्रत्येक माह अभिभावकों से मिलते हैं",
            "उनकें सुझाव को योजनाओं और प्रक्रिया में शामिल करतें हैं"
        ]
    },
    {
        "id": "Q2",
        "text": "मासिक स्कूल प्रबंधन समिति की बैठक में शिक्षक की भागीदारी का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "भागीदारी सीमित और अनियमित हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं लेकिन सीख पर सुझाव सीमित रहता हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं और विद्यालय विकास + सीख पर विचार साझा करते हैं",
            "वे विद्यालय विकास योजना बनाने में सहयोग भी  करते हैं"
        ]
    },
    {
        "id": "Q3",
        "text": "शिक्षक द्वारा  समुदाय की भागीदारी बढ़ाने के लिए प्रयास का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "केवल तब ही संवाद करना जब वे ख़ुद शिक्षक को संपर्क करते",
            "सामाजिक या विभागीय कार्यक्रमों के दौरान ही संवाद करना",
            "स्थानीय संसाधनों की निर्देशिका तैयार",
            "आवश्यकता अनुसार सामुदाय से सहयोग माँगना",
            "महीने में एक बार बच्चों को स्थानीय संसाधनों के साथ संवाद का अवसर",
            "सामुदाय सहभागिता की योजना"
        ]
    },
    {
        "id": "Q4",
        "text": "कक्षा योजना बनाने के लिए किन प्रारूपों  और सूत्रो का  उपयोग किया जा रहा हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "विभाग द्वारा प्रदान योजना",
            "व्यक्तिगत रूप से बनाई गई योजना",
            "संकुल बैठक में बनाई योजना",
            "बच्चों और समुदाय के सुझाव योजना में शामिल"
        ]
    },
    {
        "id": "Q5",
        "text": "बनायी गई योजना में LO को शामिल किया जाना और उनका स्रोत  कैसा है ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "विभाग की सूची से लिए गए है",
            "इस माह के पाठ्यक्रम से लिए गए है",
            "चिन्हित अवधारणों को ध्यान में रख कर लिए गए है",
            "बच्चों की जरूरतों को समझते हुए",
            "विभिन्न विषयों के बीच परस्पर जोड़ कर  चिह्नित किए गए हैं"
        ]
    },
    {
        "id": "Q6",
        "text": "योजना में  शामिल गतिविधियों की स्थिति कैसी है ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पाठ्यपुस्तक को और रोचक बनाने के लिए गतिविधियाँ शामिल की गई हैं",
            "पाठ्यपुस्तक की गतिविधियाँ योजना में नियमित रूप से व्यवस्थित की गई हैं",
            "प्रत्येक LO के लिए",
            "अवधारणात्मक + दक्षता पर केंद्रित गतिविधियाँ चिह्नित की गई हैं",
            "वास्तविक जीवन के संदर्भ में कौशलों के उपयोग और समुदाय की आवश्यकताओं को पूरा करने के लिए गतिविधियाँ शामिल की गई हैं"
        ]
    },
    {
        "id": "Q7",
        "text": "शिक्षक, किस प्रकार की बैठने की व्यवस्था का उपयोग कर रही/रहे हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पंक्तियो में बैठना",
            "बालक और बालिका अलग-अलग बैठनाना",
            "बिना उद्देश्य समझे व्यवस्था बदलना",
            "बड़ा समूह",
            "छोटा समूह",
            "व्यक्तिगत अभ्यास कार्य के अनुसार बैठने की व्यवस्था बदलना",
            "बड़ा -छोटा समूह और व्यक्तिगत अभ्यास  के अलावा अन्य संरचनाएं बनाना",
            "बच्चे स्वयं भी बैठक व्यवस्था तय करते हैं"
        ]
    },
    {
        "id": "Q8",
        "text": "शिक्षक द्वारा  संसाधनों के  उपयोग और LO से उनके जुड़ाव का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पाठ्यपुस्तक और ब्लैकबोर्ड",
            "विभिन्न संसाधनों  का उपयोग पर LO से सुमेलित नहीं",
            "LO से सुमेलित उपलब्ध संसाधनों का उपयोग",
            "LO से सुमेलित स्थानीय संसाधनों का उपयोग"
        ]
    },
    {
        "id": "Q9",
        "text": "शिक्षक बच्चों को चर्चा, संवाद और गतिविधियों में भागीदारी तथा नेतृत्व करने के अवसर कैसे  प्रदान कर रही/रहे है?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "चर्चा के अवसर नहीं है",
            "बच्चें चुपचाप बैठे हैं",
            "चुनिंदा बच्चों को सहभागिता का अवसर दिया है",
            "“सही” या पूर्वनिर्धारित उत्तरों की ही अपेक्षा हैं",
            "हर बच्चे को भाग लेने का अवसर है",
            "खुले प्रश्न सोचने के पर्याप्त समय के साथ पूछे जा रहे हैं",
            "भागीदारी पर मंथन किया है",
            "बच्चों को गतिविधियों और चर्चाओं में नेतृत्व के लिए प्रोत्साहन दिया गया है"
        ]
    },
    {
        "id": "Q10",
        "text": "शिक्षक को पाठ्यपुस्तक के विषयवस्तु में अवधारणाओं  और आवश्यक जानकारी की कितनी गहरी समझ हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "सिर्फ़ पाठ्यपुस्तक के विषयवस्तु से परिचित हैं",
            "सीखने वाली अवधारणाओं और आवश्यक जानकारी की समझ हैं",
            "कौशलों को सिखाने की दक्षता हैं",
            "मुख्य जानकारी के महत्व की समझ हैं",
            "दोनों की गहरी समझ है और वे उसका शिक्षण विधियों",
            "पाठ्यक्रम के लक्ष्यों और बच्चों की जरूरतों के अनुसार उपयोग  करते हैं"
        ]
    },
    {
        "id": "Q11",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किन विधियों का प्रयोग करते हैं ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "व्याख्यान विधि का उपयोग",
            "बच्चों के जीवन के उदाहरणों से जोड़ते हुए रोचक बनाकर",
            "पाठ्यचर्या के लक्ष्यों और विषय के प्रमुख विचार से जोड़ते हुए",
            "अवधारणाओं की समझ और कौशलों का विकास गतिविधियों (इनडोर और आउटडोर) में सम्मिलित",
            "विद्यार्थियों को समझकर और उनसे संबंध स्थापित करना",
            "विषयवस्तु और लर्निंग आउटकम्स (LOs) को जीवन के लक्ष्यों से जोड़ना"
        ]
    },
    {
        "id": "Q12",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किस प्रकार से  बच्चों का रचनात्मत आंकलन करते हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "मौखिक रूप से समझ जानने की कोशिश",
            "बच्चों को अपनी समझ को प्रकट करने का अवसर",
            "सीखने की विविध गतिविधियों के दौरान",
            "अवलोकन और पूछे गए प्रश्न",
            "बच्चों को लिखित फीडबैक और आगे के लिए सुझाव"
        ]
    },
    {
        "id": "Q13",
        "text": "शिक्षक बच्चों की आवधारात्मक समझ का आंकलन कैसे करते हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "याददास्त वाले प्रश्न  जैसे - नाम बताना और विशेषताओं की सूची बनाना",
            "सही समझ",
            "पूर्ण समझ",
            "अवधारणाओं के बारे में दुविधाओं को जान पाने वाले प्रश्नों के द्वारा",
            "परिभाषित करना",
            "तुलना करना और जानकारी का उपयोग करने वाले प्रश्न के द्वारा",
            "उदाहरण देना",
            "अवधारणाओं से संबंध स्थापित करना",
            "अवधारणा मानचित्र के द्वारा"
        ]
    },
    {
        "id": "Q15",
        "text": "शिक्षक बच्चों के कौशल विकास का आंकलन कैसे करते हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पाठ्यपुस्तक-आधारित प्रश्न- मौखिक और लिखित",
            "लिखित परीक्षा और दिए गए टास्क पर प्रदर्शन",
            "सीख टास्क पर काम करने के दौरान अवलोकन और आंकलन प्रपत्र के द्वारा",
            "व्यक्तिगत फीडबैक प्रदान करना",
            "प्रत्येक कौशल में प्रगति का विभिन्न परिस्थितियों द्वारा आंकलन"
        ]
    },
    {
        "id": "Q16",
        "text": "शिक्षक फीडबैक के लिए किन प्रणालियों का उपयोग करते हैं? उनका फीडबैक किस प्रकार का होता हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "परीक्षा पत्रों/कॉपी पर सामान्य फ़ीडबैक (जैसे: बहुत अच्छा/अत्यंत कमजोर)",
            "परीक्षा पत्रों/कॉपी के आधार पर रचनात्मक फ़ीडबैक (सकारात्मक)",
            "कक्षा प्रक्रिया के दौरान अवलोकन दर्ज करना",
            "सहपाठियों के द्वारा आंकलन",
            "स्व-आंकलन का अवसर",
            "सहपाठि",
            "स्व और अभिभावक फीडबैक को उद्देश्य-परक बनाना",
            "उसका नियमित दस्तावेज़ीकर्ण करना"
        ]
    },
    {
        "id": "Q17",
        "text": "शिक्षक अपनी फाइल में किस प्रारूप में कक्षा योजना और बच्चों का अवलोकन दर्ज करते हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "अनौपचारिक रूप से/ कभी-कभी किए जाते हैं",
            "विभाग द्वारा प्रदान किए गए प्रारूप पर",
            "सहयोग के साथ- संकुल बैठक में तय प्रारूप पर",
            "अवलोकन कर उसे दर्ज किया जाता",
            "शिक्षक फ़ाइल में व्यवस्थित रूप में योजनाएँ रहती हैं",
            "प्रारूपों पर विभिन्न क्षमताओं का अवलोकन दर्ज किया जाता है"
        ]
    },
    {
        "id": "Q18",
        "text": "समूह कार्य का दस्तावेज़ कहाँ और कैसे उपलब्ध हैं ?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "बच्चों की व्यक्तिगत कॉपी में उपलब्ध",
            "समूह कार्य फ़ाइल में उपलब्ध पर अव्यवस्थित",
            "नियमित (सप्ताह में दो बार) और वयस्थित रूप में फ़ाइल में उपलब्ध",
            "सहपाठी फीडबैक तथा शिक्षक फीडबैक भी फाइल में उपलब्ध"
        ]
    },
    {
        "id": "Q19",
        "text": "बच्चों के कार्य और प्रगति कहाँ और किस तरह से उपलब्ध है?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "आंकलन सिर्फ़ परीक्षा पत्रों और रिपोर्ट कार्ड में उपलब्ध",
            "होलिस्टिक रिपोर्ट कार्ड में मासिक/त्रैमासिक रूप में उपलब्ध",
            "व्यक्दिगत कार्य पोर्टफोलियो में उपलब्ध",
            "सप्ताह में कम से कम दो बार लिखित फीडबैक दर्ज",
            "पोर्टफोलियो ऐसे व्यवस्थित कि उनसे बच्चों की प्रगति स्पष्ट हो पाये",
            "सीख प्रोफाइल में पोर्टफोलियो का उपयोग"
        ]
    },
    {
        "id": "Q20",
        "text": "क्या शिक्षक विषय से संबंधित महत्वपूर्ण विचारों को समझतें हैं? वह विषय को पढ़ने के लिए किस प्रकार की गतिविधियों का उपयोग करतें हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पारंपरिक पद्धति- पाठ सामग्री समझाना और अभ्यास प्रश्न का उल्लेख करना",
            "विभिन्न गतिविधियाँ खोजना",
            "विभाग द्वारा सूचीबद्ध अनुसार गतिविधियाँ",
            "दक्षताएं विकसित करने पर केंद्रित गतिविधियाँ"
        ]
    },
    {
        "id": "Q21",
        "text": "क्या शिक्षक को सीखने की  विभिन्न शैलियाँ के बारें में जानकारी हैं? वे उससे सीख सामग्री का प्रस्तुतीकरण में कैसे शामिल करतें हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "कक्षा और उम्र के अनुसार गतिविधि",
            "विविध शैलियों के लिए अलग गतिविधि पर चर्चा",
            "सहयोग की आवशयकता",
            "विविध शैलियों के लिए अलग गतिविधि योजना में शामिल",
            "शैलियों की समझ उपयुक्त गतिविधियाँ",
            "समीक्षा करते है"
        ]
    },
    {
        "id": "Q22",
        "text": "शिक्षक हितधारकों की अपेक्षाओं को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "माता-पिता की मुख्य अपेक्षा- परीक्षाओं में अच्छा प्रदर्शन",
            "कुछ माता-पिता से अपेक्षा पर चर्चा- बच्चों को कुशल और रोजगार उन्मुख बनाना",
            "अभिभावक/समुदाय की अपेक्षाएँ समझकर अपने तरीकों में शामिल करना",
            "उद्योग जगत",
            "समुदाय",
            "अभिभावक & सरकार की अपेक्षाएँ समझकर अपने तरीकों में शामिल"
        ]
    },
    {
        "id": "Q23",
        "text": "शिक्षक पाठ्यचर्या के लक्ष्यों को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पाठ्यपुस्तक की सामग्री को पूरा करना",
            "एनसीएफ 2005 & एनईपी 2020 का उल्लेख",
            "संकुल की शैक्षिक आवश्यकताओं के अनुसार लक्ष्यों को हासिल करना",
            "शैक्षिक नीतियों की प्रासंगिकता पर मंथन",
            "योजनाओं का छात्रों के लिए अनुकूलन"
        ]
    },
    {
        "id": "Q24",
        "text": "क्या शिक्षक बच्चों के व्यवहार को निष्पक्षता के साथ देखते हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "धीमे सीखने वाले",
            "कमजोर छात्रों जैसे शब्दों का इस्तेमाल",
            "बच्चों के व्यवहार के पीछे के कारणों को जानने का प्रयास",
            "व्यवहार को समझते हैं",
            "चर्चा में इसका उल्लेख भी करते",
            "विभिन्न पहलुओं के आधार पर आंकलन",
            "इसके अनुसार आवश्यकताओं को संबोधित करना"
        ]
    },
    {
        "id": "Q25",
        "text": "क्या शिक्षक में सीखने की ओर खुलापन हैं? वे किस तरह की विधियों का उपयोग करना सही समझतें हैं?",
        "type": "Dropdown",
        "category": "Classroom Observation",
        "options": [
            "पारंपरिक कौशलों का उपयोग",
            "फीडबैक प्राप्त करने में सहज नहीं",
            "नए विचारों की खोज का प्रयास",
            "फीडबैक देने के लिए प्रोत्साहित करना",
            "स्वयं सीखने की पहल करते हैं",
            "फीडबैक आदान-प्रदान करते हैं",
            "स्वयं सीखने और आत्ममंथन करने पर कार्य",
            "स्वयं का मूल्यांकन"
        ]
    },
    
    {
        "id": "Q1",
        "text": "शिक्षक अभिवावकों से कब-कब संवाद करते हैं और  उनके फीडबैक को कैसे अपनाते  हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "संवाद केवल साल में एक बार रिपोर्ट कार्ड साझा करने के दौरान किया जाता हैं",
            "त्रैमासिक रूप से बैठकें की जाती है पर फीडबैक के अवसर सीमित हैं",
            "अभिभावकों के फीडबैक देने के प्रचुर अवसर सृजित करें जाते हैं",
            "प्रत्येक माह अभिभावकों से मिलते हैं",
            "उनकें सुझाव को योजनाओं और प्रक्रिया में शामिल करतें हैं"
        ]
    },
    {
        "id": "Q2",
        "text": "मासिक स्कूल प्रबंधन समिति की बैठक में शिक्षक की भागीदारी का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "भागीदारी सीमित और अनियमित हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं लेकिन सीख पर सुझाव सीमित रहता हैं",
            "तीन महीनों से बैठकों में उपस्थित हैं और विद्यालय विकास + सीख पर विचार साझा करते हैं",
            "वे विद्यालय विकास योजना बनाने में सहयोग भी  करते हैं"
        ]
    },
    {
        "id": "Q3",
        "text": "शिक्षक द्वारा  समुदाय की भागीदारी बढ़ाने के लिए प्रयास का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "केवल तब ही संवाद करना जब वे ख़ुद शिक्षक को संपर्क करते",
            "सामाजिक या विभागीय कार्यक्रमों के दौरान ही संवाद करना",
            "स्थानीय संसाधनों की निर्देशिका तैयार",
            "आवश्यकता अनुसार सामुदाय से सहयोग माँगना",
            "महीने में एक बार बच्चों को स्थानीय संसाधनों के साथ संवाद का अवसर",
            "सामुदाय सहभागिता की योजना"
        ]
    },
    {
        "id": "Q4",
        "text": "कक्षा योजना बनाने के लिए किन प्रारूपों  और सूत्रो का  उपयोग किया जा रहा हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "विभाग द्वारा प्रदान योजना",
            "व्यक्तिगत रूप से बनाई गई योजना",
            "संकुल बैठक में बनाई योजना",
            "बच्चों और समुदाय के सुझाव योजना में शामिल"
        ]
    },
    {
        "id": "Q5",
        "text": "बनायी गई योजना में LO को शामिल किया जाना और उनका स्रोत  कैसा है ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "विभाग की सूची से लिए गए है",
            "इस माह के पाठ्यक्रम से लिए गए है",
            "चिन्हित अवधारणों को ध्यान में रख कर लिए गए है",
            "बच्चों की जरूरतों को समझते हुए",
            "विभिन्न विषयों के बीच परस्पर जोड़ कर  चिह्नित किए गए हैं"
        ]
    },
    {
        "id": "Q6",
        "text": "योजना में  शामिल गतिविधियों की स्थिति कैसी है ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पाठ्यपुस्तक को और रोचक बनाने के लिए गतिविधियाँ शामिल की गई हैं",
            "पाठ्यपुस्तक की गतिविधियाँ योजना में नियमित रूप से व्यवस्थित की गई हैं",
            "प्रत्येक LO के लिए",
            "अवधारणात्मक + दक्षता पर केंद्रित गतिविधियाँ चिह्नित की गई हैं",
            "वास्तविक जीवन के संदर्भ में कौशलों के उपयोग और समुदाय की आवश्यकताओं को पूरा करने के लिए गतिविधियाँ शामिल की गई हैं"
        ]
    },
    {
        "id": "Q7",
        "text": "शिक्षक, किस प्रकार की बैठने की व्यवस्था का उपयोग कर रही/रहे हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पंक्तियो में बैठना",
            "बालक और बालिका अलग-अलग बैठनाना",
            "बिना उद्देश्य समझे व्यवस्था बदलना",
            "बड़ा समूह",
            "छोटा समूह",
            "व्यक्तिगत अभ्यास कार्य के अनुसार बैठने की व्यवस्था बदलना",
            "बड़ा -छोटा समूह और व्यक्तिगत अभ्यास  के अलावा अन्य संरचनाएं बनाना",
            "बच्चे स्वयं भी बैठक व्यवस्था तय करते हैं"
        ]
    },
    {
        "id": "Q8",
        "text": "शिक्षक द्वारा  संसाधनों के  उपयोग और LO से उनके जुड़ाव का स्तर कैसा है ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पाठ्यपुस्तक और ब्लैकबोर्ड",
            "विभिन्न संसाधनों  का उपयोग पर LO से सुमेलित नहीं",
            "LO से सुमेलित उपलब्ध संसाधनों का उपयोग",
            "LO से सुमेलित स्थानीय संसाधनों का उपयोग"
        ]
    },
    {
        "id": "Q9",
        "text": "शिक्षक बच्चों को चर्चा, संवाद और गतिविधियों में भागीदारी तथा नेतृत्व करने के अवसर कैसे  प्रदान कर रही/रहे है?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "चर्चा के अवसर नहीं है",
            "बच्चें चुपचाप बैठे हैं",
            "चुनिंदा बच्चों को सहभागिता का अवसर दिया है",
            "“सही” या पूर्वनिर्धारित उत्तरों की ही अपेक्षा हैं",
            "हर बच्चे को भाग लेने का अवसर है",
            "खुले प्रश्न सोचने के पर्याप्त समय के साथ पूछे जा रहे हैं",
            "भागीदारी पर मंथन किया है",
            "बच्चों को गतिविधियों और चर्चाओं में नेतृत्व के लिए प्रोत्साहन दिया गया है"
        ]
    },
    {
        "id": "Q10",
        "text": "शिक्षक को पाठ्यपुस्तक के विषयवस्तु में अवधारणाओं  और आवश्यक जानकारी की कितनी गहरी समझ हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "सिर्फ़ पाठ्यपुस्तक के विषयवस्तु से परिचित हैं",
            "सीखने वाली अवधारणाओं और आवश्यक जानकारी की समझ हैं",
            "कौशलों को सिखाने की दक्षता हैं",
            "मुख्य जानकारी के महत्व की समझ हैं",
            "दोनों की गहरी समझ है और वे उसका शिक्षण विधियों",
            "पाठ्यक्रम के लक्ष्यों और बच्चों की जरूरतों के अनुसार उपयोग  करते हैं"
        ]
    },
    {
        "id": "Q11",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किन विधियों का प्रयोग करते हैं ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "व्याख्यान विधि का उपयोग",
            "बच्चों के जीवन के उदाहरणों से जोड़ते हुए रोचक बनाकर",
            "पाठ्यचर्या के लक्ष्यों और विषय के प्रमुख विचार से जोड़ते हुए",
            "अवधारणाओं की समझ और कौशलों का विकास गतिविधियों (इनडोर और आउटडोर) में सम्मिलित",
            "विद्यार्थियों को समझकर और उनसे संबंध स्थापित करना",
            "विषयवस्तु और लर्निंग आउटकम्स (LOs) को जीवन के लक्ष्यों से जोड़ना"
        ]
    },
    {
        "id": "Q12",
        "text": "शिक्षक सीख सामग्री के प्रस्तुतीकरण (फ़ेसिलिटेशन) के दौरान किस प्रकार से  बच्चों का रचनात्मत आंकलन करते हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "मौखिक रूप से समझ जानने की कोशिश",
            "बच्चों को अपनी समझ को प्रकट करने का अवसर",
            "सीखने की विविध गतिविधियों के दौरान",
            "अवलोकन और पूछे गए प्रश्न",
            "बच्चों को लिखित फीडबैक और आगे के लिए सुझाव"
        ]
    },
    {
        "id": "Q13",
        "text": "शिक्षक बच्चों की आवधारात्मक समझ का आंकलन कैसे करते हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "याददास्त वाले प्रश्न  जैसे - नाम बताना और विशेषताओं की सूची बनाना",
            "सही समझ",
            "पूर्ण समझ",
            "अवधारणाओं के बारे में दुविधाओं को जान पाने वाले प्रश्नों के द्वारा",
            "परिभाषित करना",
            "तुलना करना और जानकारी का उपयोग करने वाले प्रश्न के द्वारा",
            "उदाहरण देना",
            "अवधारणाओं से संबंध स्थापित करना",
            "अवधारणा मानचित्र के द्वारा"
        ]
    },
    {
        "id": "Q14",
        "text": "शिक्षक बच्चों के कौशल विकास का आंकलन कैसे करते हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पाठ्यपुस्तक-आधारित प्रश्न- मौखिक और लिखित",
            "लिखित परीक्षा और दिए गए टास्क पर प्रदर्शन",
            "सीख टास्क पर काम करने के दौरान अवलोकन और आंकलन प्रपत्र के द्वारा",
            "व्यक्तिगत फीडबैक प्रदान करना",
            "प्रत्येक कौशल में प्रगति का विभिन्न परिस्थितियों द्वारा आंकलन"
        ]
    },
    {
        "id": "Q15",
        "text": "शिक्षक फीडबैक के लिए किन प्रणालियों का उपयोग करते हैं? उनका फीडबैक किस प्रकार का होता हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "परीक्षा पत्रों/कॉपी पर सामान्य फ़ीडबैक (जैसे: बहुत अच्छा/अत्यंत कमजोर)",
            "परीक्षा पत्रों/कॉपी के आधार पर रचनात्मक फ़ीडबैक (सकारात्मक)",
            "कक्षा प्रक्रिया के दौरान अवलोकन दर्ज करना",
            "सहपाठियों के द्वारा आंकलन",
            "स्व-आंकलन का अवसर",
            "सहपाठि",
            "स्व और अभिभावक फीडबैक को उद्देश्य-परक बनाना",
            "उसका नियमित दस्तावेज़ीकर्ण करना"
        ]
    },
    {
        "id": "Q16",
        "text": "शिक्षक अपनी फाइल में किस प्रारूप में कक्षा योजना और बच्चों का अवलोकन दर्ज करते हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "अनौपचारिक रूप से/ कभी-कभी किए जाते हैं",
            "विभाग द्वारा प्रदान किए गए प्रारूप पर",
            "सहयोग के साथ- संकुल बैठक में तय प्रारूप पर",
            "अवलोकन कर उसे दर्ज किया जाता",
            "शिक्षक फ़ाइल में व्यवस्थित रूप में योजनाएँ रहती हैं",
            "प्रारूपों पर विभिन्न क्षमताओं का अवलोकन दर्ज किया जाता है"
        ]
    },
    {
        "id": "Q17",
        "text": "समूह कार्य का दस्तावेज़ कहाँ और कैसे उपलब्ध हैं ?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "बच्चों की व्यक्तिगत कॉपी में उपलब्ध",
            "समूह कार्य फ़ाइल में उपलब्ध पर अव्यवस्थित",
            "नियमित (सप्ताह में दो बार) और वयस्थित रूप में फ़ाइल में उपलब्ध",
            "सहपाठी फीडबैक तथा शिक्षक फीडबैक भी फाइल में उपलब्ध"
        ]
    },
    {
        "id": "Q18",
        "text": "बच्चों के कार्य और प्रगति कहाँ और किस तरह से उपलब्ध है?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "आंकलन सिर्फ़ परीक्षा पत्रों और रिपोर्ट कार्ड में उपलब्ध",
            "होलिस्टिक रिपोर्ट कार्ड में मासिक/त्रैमासिक रूप में उपलब्ध",
            "व्यक्दिगत कार्य पोर्टफोलियो में उपलब्ध",
            "सप्ताह में कम से कम दो बार लिखित फीडबैक दर्ज",
            "पोर्टफोलियो ऐसे व्यवस्थित कि उनसे बच्चों की प्रगति स्पष्ट हो पाये",
            "सीख प्रोफाइल में पोर्टफोलियो का उपयोग"
        ]
    },
    {
        "id": "Q19",
        "text": "क्या शिक्षक विषय से संबंधित महत्वपूर्ण विचारों को समझतें हैं? वह विषय को पढ़ने के लिए किस प्रकार की गतिविधियों का उपयोग करतें हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पारंपरिक पद्धति- पाठ सामग्री समझाना और अभ्यास प्रश्न का उल्लेख करना",
            "विभिन्न गतिविधियाँ खोजना",
            "विभाग द्वारा सूचीबद्ध अनुसार गतिविधियाँ",
            "दक्षताएं विकसित करने पर केंद्रित गतिविधियाँ"
        ]
    },
    {
        "id": "Q20",
        "text": "क्या शिक्षक को सीखने की  विभिन्न शैलियाँ के बारें में जानकारी हैं? वे उससे सीख सामग्री का प्रस्तुतीकरण में कैसे शामिल करतें हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "कक्षा और उम्र के अनुसार गतिविधि",
            "विविध शैलियों के लिए अलग गतिविधि पर चर्चा",
            "सहयोग की आवशयकता",
            "विविध शैलियों के लिए अलग गतिविधि योजना में शामिल",
            "शैलियों की समझ उपयुक्त गतिविधियाँ",
            "समीक्षा करते है"
        ]
    },
    {
        "id": "Q21",
        "text": "शिक्षक हितधारकों की अपेक्षाओं को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "माता-पिता की मुख्य अपेक्षा- परीक्षाओं में अच्छा प्रदर्शन",
            "कुछ माता-पिता से अपेक्षा पर चर्चा- बच्चों को कुशल और रोजगार उन्मुख बनाना",
            "अभिभावक/समुदाय की अपेक्षाएँ समझकर अपने तरीकों में शामिल करना",
            "उद्योग जगत",
            "समुदाय",
            "अभिभावक & सरकार की अपेक्षाएँ समझकर अपने तरीकों में शामिल"
        ]
    },
    {
        "id": "Q22",
        "text": "शिक्षक पाठ्यचर्या के लक्ष्यों को कैसे समझतें हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पाठ्यपुस्तक की सामग्री को पूरा करना",
            "एनसीएफ 2005 & एनईपी 2020 का उल्लेख",
            "संकुल की शैक्षिक आवश्यकताओं के अनुसार लक्ष्यों को हासिल करना",
            "शैक्षिक नीतियों की प्रासंगिकता पर मंथन",
            "योजनाओं का छात्रों के लिए अनुकूलन"
        ]
    },
    {
        "id": "Q23",
        "text": "क्या शिक्षक बच्चों के व्यवहार को निष्पक्षता के साथ देखते हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "धीमे सीखने वाले",
            "कमजोर छात्रों जैसे शब्दों का इस्तेमाल",
            "बच्चों के व्यवहार के पीछे के कारणों को जानने का प्रयास",
            "व्यवहार को समझते हैं",
            "चर्चा में इसका उल्लेख भी करते",
            "विभिन्न पहलुओं के आधार पर आंकलन",
            "इसके अनुसार आवश्यकताओं को संबोधित करना"
        ]
    },
    {
        "id": "Q24",
        "text": "क्या शिक्षक में सीखने की ओर खुलापन हैं? वे किस तरह की विधियों का उपयोग करना सही समझतें हैं?",
        "type": "Dropdown",
        "category": "School Visit",
        "options": [
            "पारंपरिक कौशलों का उपयोग",
            "फीडबैक प्राप्त करने में सहज नहीं",
            "नए विचारों की खोज का प्रयास",
            "फीडबैक देने के लिए प्रोत्साहित करना",
            "स्वयं सीखने की पहल करते हैं",
            "फीडबैक आदान-प्रदान करते हैं",
            "स्वयं सीखने और आत्ममंथन करने पर कार्य",
            "स्वयं का मूल्यांकन"
        ]
    }
    
    
]

# --- PART 2: PROCESS FIELD INDICATORS (Checkboxes) ---
indicator_list = [
    {
        "id": "GP_1",
        "text": "बैठक का स्थान सार्वजनिक स्थल है",
        "category": "GP"
    },
    {
        "id": "GP_2",
        "text": "पिछली बैठक से इस बैठक का अंतराल 3 माह से कम है",
        "category": "GP"
    },
    {
        "id": "GP_3",
        "text": "बैठक व्यवस्था समान रही - (यदि कुर्सियां तो सबके लिए और यदि दरी तो सबके लिए )",
        "category": "GP"
    },
    {
        "id": "GP_4",
        "text": "ग्राम पंचायत बैठक की चर्चा हेतु आंकड़ो पर आधारित रिपोर्ट सभी प्रतिभागियों के साथ साझा की गई",
        "category": "GP"
    },
    {
        "id": "GP_5",
        "text": "शिक्षा समिति का गठन नियमानुसार है",
        "category": "GP"
    },
    {
        "id": "GP_6",
        "text": "ग्राम पंचायत में लर्निंग आउटकम की कक्षा वार सूची चस्पा है और सभी सदस्यों को उसकी समझ है । इसके लिए LO की सूची ग्राम पंचायत भवन में लगे होंगे।",
        "category": "GP"
    },
    {
        "id": "GP_7",
        "text": "पिछली बैठक से इस बैठक के बीच में शिक्षा समिति के सदस्यों ने प्रत्येक स्कूल का एक बार से अधिक भ्रमण कर, स्थिति की जानकारी हासिल की",
        "category": "GP"
    },
    {
        "id": "GP_8",
        "text": "ग्राम पंचायत के सभी विद्यालयों में विद्यालय प्रबंधन समिति का गठन नियमानुसार है",
        "category": "GP"
    },
    {
        "id": "GP_9",
        "text": "बैठक में अपेक्षित सभी सदस्यों की सहभागिता (शिक्षा समिति सदस्य, विद्यालय प्रबंधन समिति सदस्य, ग्राम पंचायत सचिव, छात्र आदि)",
        "category": "GP"
    },
    {
        "id": "GP_10",
        "text": "बैठक में प्रत्येक आमंत्रित विभाग के प्रतिनिधि शामिल रहे ( शिक्षा, स्वास्थ्य, महिला व् बाल विकास, पंचायती राज)",
        "category": "GP"
    },
    {
        "id": "GP_11",
        "text": "बैठक की कुल उपस्थिति अपेक्षा के आधार पर 70% से अधिक रही",
        "category": "GP"
    },
    {
        "id": "GP_12",
        "text": "बैठक ग्राम प्रधान /सरपंच/मुखिया/शिक्षा समिति अध्यक्ष की अध्यक्षता में आयोजित हुयी",
        "category": "GP"
    },
    {
        "id": "GP_13",
        "text": "पंचायत की सभी महिला प्रतिनिधियों ने स्वयं बैठक में सहभाग किया",
        "category": "GP"
    },
    {
        "id": "GP_14",
        "text": "ग्राम पंचायत शिक्षा समिति की कार्य एवं भूमिका पर चर्चा किया गया",
        "category": "GP"
    },
    {
        "id": "GP_15",
        "text": "पिछले 3 माह में ग्राम पंचायत ने SMC बैठकों के आयोजन में, SMC को मदद देते हुए सफल आयोजन सुनिश्चित किया है",
        "category": "GP"
    },
    {
        "id": "GP_16",
        "text": "पिछली बैठक (ग्राम पंचायत अथवा विद्यालय प्रबंधन समिति, GPDP और SDP ) में लिए गए निर्णयों की समीक्षा की गयी",
        "category": "GP"
    },
    {
        "id": "GP_17",
        "text": "ग्राम पंचायत के  100% बच्चों ( बालिका, CWSN, वंचित समूह आदि सहित) का नामांकन स्कूलों और आंगन बाड़ी में है, यह आंकड़ों की समीक्षा से पुष्टि की गई",
        "category": "GP"
    },
    {
        "id": "GP_18",
        "text": "प्रत्येक विद्यालय से प्रबंधन समिति अध्यक्ष और प्रधानाध्यापक द्वारा वर्त्तमान स्थिति साझा की गई",
        "category": "GP"
    },
    {
        "id": "GP_19",
        "text": "बैठक में नामांकन के सापेक्ष  ठहराव की समीक्षा अलग से मुद्दे के रूप में की गई",
        "category": "GP"
    },
    {
        "id": "GP_20",
        "text": "शिक्षा समिति के सदस्य, शैक्षिक विकास में अपनी भूमिका को समझते हुए चर्चा में भाग ले रहे थे और समाधान तलाश रहे थे (50% से अधिक सहभागियों ने विचार रखे)",
        "category": "GP"
    },
    {
        "id": "GP_21",
        "text": "आज की बैठक में बच्चों की सीख की प्रगति की समीक्षा, लर्निंग आउटकम के आधार पर की गई",
        "category": "GP"
    },
    {
        "id": "GP_22",
        "text": "बैठक में शामिल प्रत्येक विभाग से सम्बंधित मुद्दों को चर्चा में शामिल किया गया",
        "category": "GP"
    },
    {
        "id": "GP_23",
        "text": "ग्राम पंचायत के शैक्षिक विकास के बारे में पूर्व में बनी योजनाओं का - 50% से अधिक क्रियान्वयन हुआ",
        "category": "GP"
    },
    {
        "id": "GP_24",
        "text": "बैठक में ग्राम पंचायत के सभी आंगनबाड़ी केन्द्रों एवं विद्यालयों के मुददों पर चर्चा किया गया",
        "category": "GP"
    },
    {
        "id": "GP_25",
        "text": "सभी प्रतिभागियों के सुझावों को शामिल करते हुये लिखित कार्य योजना का निर्माण किया गया",
        "category": "GP"
    },
    {
        "id": "GP_26",
        "text": "तैयार कार्ययोजना में सभी कार्य स्पष्ट रूप से, समय सीमा और जिम्मेदारी के साथ, अंकित किये गए",
        "category": "GP"
    },
    {
        "id": "GP_27",
        "text": "कार्ययोजना में मूलभूत आवश्यकताओं पर सटीक योजना बनाई गई",
        "category": "GP"
    },
    {
        "id": "GP_28",
        "text": "विविध कौशलों को अर्जित करने के लिए विविध वातावरण आयोजन, शिक्षकों को सुझाए गए",
        "category": "GP"
    },
    {
        "id": "GP_29",
        "text": "विविध सीख प्रक्रियाएं आयोजित करने के लिए स्कूलों को आवश्यक सहयोग प्रदान किया गया ( शैक्षिक भ्रमण हेतु, संसाधन व्यक्ति हेतु, प्रोजेक्ट कार्य हेतु, मॉडल कार्य हेतु, आदि )",
        "category": "GP"
    },
    {
        "id": "GP_30",
        "text": "कार्ययोजना में नामांकन और ठहराव बढाने के लिए सटीक योजना बनाई गई",
        "category": "GP"
    },
    {
        "id": "GP_31",
        "text": "कार्ययोजना में शिक्षा समिति और विद्यालय प्रबंधन समिति के सशक्तिकरण के लिए सटीक योजना बनाई गई",
        "category": "GP"
    },
    {
        "id": "GP_32",
        "text": "स्कूलों में शैक्षिक वातावरण को समझने और उसे सहयोग देने के लिए ग्राम पंचायत नियमित रूप से शिक्षकों और संकुल समन्वयक के साथ संवाद की कार्ययोजना बनायीं गई",
        "category": "GP"
    },
    {
        "id": "GP_33",
        "text": "बैठक कार्यवाही पंचायत, बैठक के दौरान ही पंजिका में अंकित की गई",
        "category": "GP"
    },
    {
        "id": "GP_34",
        "text": "आगामी ग्राम पंचायत बैठक की तिथि का निर्धारण किया गया",
        "category": "GP"
    },
    {
        "id": "GP_35",
        "text": "बैठक 2 घंटे से अधिक देर तक चली",
        "category": "GP"
    },
    {
        "id": "GP_36",
        "text": "बैठक में लिये गये मुख्य निर्णयों को सभी प्रतिभागियों के साथ साझा किया गया",
        "category": "GP"
    },
    {
        "id": "GP_37",
        "text": "बैठक की कार्यवाही और कार्ययोजना, विकास खण्ड/प्रखंड  को प्रेषित की गई",
        "category": "GP"
    },
    {
        "id": "GP_38",
        "text": "मुद्दों के निस्तारण हेतु ब्लॉक पंचायत और जिला पंचायत को अनुरोध और प्रस्ताव लिखित रूप में भेजे गए",
        "category": "GP"
    },
    {
        "id": "GP_39",
        "text": "प्रत्येक GPDP में शैक्षिक विकास के लिए संसाधनों का आवंटन प्राथमिकता देकर किया जाता है",
        "category": "GP"
    },
    {
        "id": "GP_40",
        "text": "परंपरागत जिम्मेदारियों से अलग हटकर भी ग्राम पंचायत द्वारा शैक्षिक उन्नति हेतु, कदम उठाये गए (जैसे पाठ्यक्रम समीक्षा हेतु, शिक्षक प्रशिक्षण हेतु, नियमों में बदलाव हेतु - राज्य स्तरीय इकाइयों को प्रस्ताव लिखना आदि )",
        "category": "GP"
    },
    {
        "id": "BPM_1",
        "text": "बैठक का स्थान साफ़-सुथरा और चर्चा के लिए अनुकूल रहा |",
        "category": "BPM"
    },
    {
        "id": "BPM_2",
        "text": "बैठक आयोजन - जिले स्तर  से जारी पत्र और एजेंडा के अनुसार हुआ",
        "category": "BPM"
    },
    {
        "id": "BPM_3",
        "text": "बैठक आयोजन - ब्लॉक स्तर  से जारी पत्र और एजेंडा के अनुसार हुआ",
        "category": "BPM"
    },
    {
        "id": "BPM_4",
        "text": "बैठक की कुल उपस्थिति 70% से अधिक रही |",
        "category": "BPM"
    },
    {
        "id": "BPM_5",
        "text": "बैठक में ब्लॉक के सभी संकुलों की सहभागिता रही |",
        "category": "BPM"
    },
    {
        "id": "BPM_6",
        "text": "प्रत्येक संकुल से पिछली संकुल बैठक के मुख्य अंश साझा किये गए |",
        "category": "BPM"
    },
    {
        "id": "BPM_7",
        "text": "संकुल बैठकों की शेयरिंग के दौरान यथोचित प्रसंशा और सुझाव दिए जा रहे थे |",
        "category": "BPM"
    },
    {
        "id": "BPM_8",
        "text": "संकुल बैठकों के आयोजन सम्बन्धी पिछले माह के अनुभवों को ध्यान में रखते हुए इस माह की संकुल बैठक के ध्यान देने वाले बिंदु निर्धारित किये गए |",
        "category": "BPM"
    },
    {
        "id": "BPM_9",
        "text": "संकुल बैठकों के प्रभावी आयोजन में संकुल समन्वयक/संकुल शिक्षक को आने वाली अड़चनों पर चर्चा करते हुए, मिलकर समाधान खोजे गए",
        "category": "BPM"
    },
    {
        "id": "BPM_10",
        "text": "बैठक का नेतृत्व BRC/ARP/BEO/ संकुल प्राचार्य में से किसी के द्वारा किया गया |",
        "category": "BPM"
    },
    {
        "id": "BPM_11",
        "text": "बैठक में DIET अधिकारीयों की सहभागिता रही |",
        "category": "BPM"
    },
    {
        "id": "BPM_12",
        "text": "संकुल समन्वयक/संकुल शिक्षक, बैठक के दौरान समय-समय पर सत्रों का नेतृत्व ले रहे थे |",
        "category": "BPM"
    },
    {
        "id": "BPM_13",
        "text": "अगले माह के लिए  प्रत्येक कक्षा और विषय के पाठों की पहचान की गई |",
        "category": "BPM"
    },
    {
        "id": "BPM_14",
        "text": "अगले माह के पाठों की पहचान के आधार पर अकादमिक योजना के लिए LO निर्धारित किये गए |",
        "category": "BPM"
    },
    {
        "id": "BPM_15",
        "text": "लर्निंग आउटकम को हासिल करने के लिए गतिविधियों हेतु मुख्य सुझाव तय किये गए |",
        "category": "BPM"
    },
    {
        "id": "BPM_16",
        "text": "शिक्षकों के व्यावसायिक विकास के पहलुओं/संकेतकों पर चर्चा कर, उनको पोषण देने के उपाय भी योजना में शामिल किये गए (जैसे फैसिलिटेशन, नियोजन, आंकलन आदि को बेहतर करने के तरीके)",
        "category": "BPM"
    },
    {
        "id": "BPM_17",
        "text": "एक लिखित अकादमिक योजना की रूपरेखा बैठक के अन्त तक पूर्ण हुई |",
        "category": "BPM"
    },
    {
        "id": "BPM_18",
        "text": "अकादमिक योजना की रूपरेखा निर्धारण में 50% से अधिक सहभागियों ने योगदान दिया |",
        "category": "BPM"
    },
    {
        "id": "BPM_19",
        "text": "आगामी माह की संकुल बैठक हेतु संकुल वार जिम्मेदारी वितरण, लिखित रूप में किया गया |",
        "category": "BPM"
    },
    {
        "id": "BPM_20",
        "text": "बैठक में जिला स्तरीय बैठक के निर्णयों को ध्यान में रखते हुए चर्चा और नियोजन किया गया |",
        "category": "BPM"
    },
    {
        "id": "BPM_21",
        "text": "बैठक की कार्यवाही, दस्तावेज के रूप में दर्ज की गई |",
        "category": "BPM"
    },
    {
        "id": "BPM_22",
        "text": "बैठक  समय से शुरू होकर 2 घंटे से अधिक समय तक चली |",
        "category": "BPM"
    },
    {
        "id": "DIET_1",
        "text": "मासिक समीक्षा व योजना बैठक हेतु, पूर्व में ही एजेंडा और आयोजन की सूचना  सभी के साथ साझा किया गया था",
        "category": "DIET"
    },
    {
        "id": "DIET_2",
        "text": "बैठक निर्धारित समय से शुरू होते हुए 2 घंटे से अधिक समय तक हुई",
        "category": "DIET"
    },
    {
        "id": "DIET_3",
        "text": "बैठक हेतु सभी की जिम्मेदारियां पूर्व में तय की गई थी",
        "category": "DIET"
    },
    {
        "id": "DIET_4",
        "text": "बैठक हेतु जरुरी संसाधन बैठक कक्ष में उपलब्ध रहे , जैसे - प्रोजेक्टर, लाइट, माइक, कार्यवाही रजिस्टर आदि",
        "category": "DIET"
    },
    {
        "id": "DIET_5",
        "text": "बैठक में सभी ब्लॉक से सहभागिता की गई थी",
        "category": "DIET"
    },
    {
        "id": "DIET_6",
        "text": "बैठक में 80% अपेक्षित सहभागियों  द्वारा सहभागिता की गई",
        "category": "DIET"
    },
    {
        "id": "DIET_7",
        "text": "बैठक में 90% डायट मेंटर द्वारा सहभाग किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_8",
        "text": "बैठक का नेतृत्व डायट प्राचार्य द्वारा किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_9",
        "text": "बैठक में समीक्षा और चर्चा हेतु आंकड़ों का प्रदर्शन किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_10",
        "text": "प्रस्तुत किये गए आंकड़े , गुणवत्ता को दर्शाने के लिए सटीक थे",
        "category": "DIET"
    },
    {
        "id": "DIET_11",
        "text": "पिछली बैठक के निर्णयों/कार्यवाही से सभी प्रतिभागियों को अवगत कराया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_12",
        "text": "सभी ब्लॉक से आये प्रतिनिधियों  को शेयरिंग करने के अवसर मिले",
        "category": "DIET"
    },
    {
        "id": "DIET_13",
        "text": "शेयरिंग के दौरान निकलने वाले मुख्य बिन्दुओं पर सुधारात्मक सुझाव और प्रोत्साहन भी दिया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_14",
        "text": "शेयरिंग के दौरान सामने आये अनसुलझे बिन्दुओं को समाधान खोजने हेतु  संकलित किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_15",
        "text": "आवश्यकता अनुरूप अलग अलग सत्र के बैठक व्यवस्था में बदलाव किया गया ( समग्र समूह, छोटे समूह में कार्य, समूह का प्रस्तुतीकरण आदि)",
        "category": "DIET"
    },
    {
        "id": "DIET_",
        "text": "माह के लिए योजना हेतु प्राथमिकता वाले बिन्दुओं को तय किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_16",
        "text": "प्राथमिकता वाले बिन्दुओं के आधार पर विकासखण्डवार/प्रखंड वार  स्पष्ट योजना का निर्माण/निर्धारण किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_17",
        "text": "लिए गए प्रत्येक निर्णय के लिए जिम्मेदार व्यक्ति को नामित किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_18",
        "text": "प्रत्येक योजना के साथ स्पष्ट समय सीमा निर्धारित की गई",
        "category": "DIET"
    },
    {
        "id": "DIET_19",
        "text": "आवशयकता अनुरूप योजना क्रियान्वयन के लिए उपकरण निर्माण किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_20",
        "text": "बैठक कार्यवाही को बैठक के दौरान ही कार्यवाही रजिस्टर में अंकित किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_21",
        "text": "बैठक में लिए गए निर्णयों एवं निष्कर्षों को सभी के साथ साझा करते हुए बैठक में लिखित कार्यवाही से सभी को अवगत कराया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_22",
        "text": "बैठक का संचालन एजेंडा में  निर्धारित सत्रों के अनुरूप किया गया",
        "category": "DIET"
    },
    {
        "id": "DIET_23",
        "text": "अगले माह की बैठक की तिथि तय कर, आवश्यक तैयारियों की जानकारी दी गयी",
        "category": "DIET"
    },
    {
        "id": "DIET_24",
        "text": "जिले की उपलब्धियों और आवश्यकताओं की औपचारिक जानकारी, बैठक के उपरांत  राज्य को प्रेषित की गई",
        "category": "DIET"
    },
    {
        "id": "BESC_1",
        "text": "बैठक का स्थान साफ़-सुथरा और चर्चा के लिए अनुकूल रहा",
        "category": "BESC"
    },
    {
        "id": "BESC_2",
        "text": "बैठक के लिए आवश्यक सभी दस्तावेज (प्रगति रिपोर्ट, वर्त्तमान स्थिति के आंकड़े, कार्यवाही रजिस्टर आदि) की उपलब्धता सुनिश्चित की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_3",
        "text": "बैठक में सभी आमंत्रित विभागों के प्रतिनिधियों ने बैठक में सहभाग किया",
        "category": "BESC"
    },
    {
        "id": "BESC_4",
        "text": "बैठक में ब्लॉक स्तरीय शिक्षा समिति के सभी सदस्य और अध्यक्ष पूरे समय शामिल रहे",
        "category": "BESC"
    },
    {
        "id": "BESC_5",
        "text": "बैठक की कुल उपस्थिति अपेक्षा के आधार पर 70% से अधिक रही",
        "category": "BESC"
    },
    {
        "id": "BESC_6",
        "text": "पिछली बैठक में लिए गए निर्णयों के सापेक्ष क्रियान्वयन की समीक्षा (अनिस्तारित योजनाओं पर जिम्मेदारी तय करके, पुन: योजना में शामिल किया गया)  की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_7",
        "text": "ब्लॉक क्षेत्र में आयोजित ग्राम पंचायत बैठकों के दौरान की गई कार्ययोजना और उसके क्रियान्वयन की समीक्षा की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_8",
        "text": "बैठक में शामिल प्रत्येक विभाग से सम्बंधित मुद्दों को चर्चा में शामिल किया गया",
        "category": "BESC"
    },
    {
        "id": "BESC_9",
        "text": "ब्लॉक क्षेत्र की अब तक की समस्त कार्ययोजनाओं के सापेक्ष क्रियान्वयन का प्रतिशत 50% से अधिक रहा",
        "category": "BESC"
    },
    {
        "id": "BESC_10",
        "text": "ब्लॉक की शैक्षिक आवश्यकताओं की पहचान के लिए वर्तमान स्थिति से जुड़े आंकड़ों पर चर्चा की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_11",
        "text": "वर्त्तमान स्थिति के आंकड़ों को सम्बंधित विभाग के प्रतिनिधियों द्वारा प्रस्तुत किया गया",
        "category": "BESC"
    },
    {
        "id": "BESC_12",
        "text": "प्रस्तुत किये गए आंकड़े, स्थिति को समझने के लिए सटीक रहे",
        "category": "BESC"
    },
    {
        "id": "BESC_13",
        "text": "आंकड़ों के आधार पर ब्लॉक की मुख्य शैक्षिक आवश्यकताओं की पहचान कर प्राथमिकता तय की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_14",
        "text": "प्राथमिकता के आधार पर ब्लाक स्तरीय कार्ययोजना तैयार की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_15",
        "text": "तैयार कार्ययोजना में सभी विभागों से जुड़े कार्य स्पष्ट रूप से, समय सीमा और जिम्मेदारी के साथ, अंकित किये गए",
        "category": "BESC"
    },
    {
        "id": "BESC_16",
        "text": "निर्धारित कार्ययोजना के क्रियान्वयन हेतु आवश्यक बजट की व्यवस्था, सुनिश्चित की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_17",
        "text": "तैयार कार्ययोजना में -  मूलभूत सुविधाओं  के लिए योजना की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_18",
        "text": "तैयार कार्ययोजना में -  नामांकन और ठहराव बढ़ाने  के लिए योजना की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_19",
        "text": "तैयार कार्ययोजना में -  सीख की गुणवत्ता बढ़ाने  के लिए योजना की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_20",
        "text": "तैयार कार्ययोजना में -  ग्राम पंचायत शिक्षा समिति और विद्यालय प्रबंधन समिति के सशक्तिकरण  के लिए योजना की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_21",
        "text": "चर्चा और कार्ययोजना निर्धारण में 50% से अधिक सहभागियों की भागीदारी रही",
        "category": "BESC"
    },
    {
        "id": "BESC_22",
        "text": "अगली बैठक का प्रस्तावित दिनांक, बैठक समापन के पूर्व निर्धारित की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_23",
        "text": "ग्राम पंचायत स्तरीय शिक्षा समिति बैठकों का रोस्टर निर्धारित किया गया",
        "category": "BESC"
    },
    {
        "id": "BESC_24",
        "text": "बैठक की कार्यवाही, दस्तावेज के रूप में दर्ज की गई",
        "category": "BESC"
    },
    {
        "id": "BESC_",
        "text": "बैठक 2 घंटे से अधिक समय तक चली",
        "category": "BESC"
    }
]

# --- PART 3: HELPER FUNCTIONS ---
def get_form_questions(selected_category):
    return [q for q in questions_list if q.get('category') == selected_category]

def get_process_indicators(selected_category):
    return [ind for ind in indicator_list if ind.get('category') == selected_category]
